In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%pylab inline
import seaborn as sns

# loading data
titanic_df = pd.read_csv("titanic-data.csv")

Populating the interactive namespace from numpy and matplotlib

In [2]:
# fill the missing age with age median for this case
titanic_df['Age'].fillna(titanic_df['Age'].median(),inplace=True)

In [3]:
def add_passenger_Age_stage(age):
    if age < 10:
        return '10'
    elif age < 20:
        return '20'
    elif age < 30:
        return '30'
    elif age < 40:
        return '40'
    elif age < 50:
        return '50'
    elif age < 60:
        return '60'
    elif age < 70:
        return '70'
    else:
        return '80'


titanic_df['Age_stage'] = titanic_df['Age'].apply(add_passenger_Age_stage)
# Sort by age
titanic_df.sort_values(by=['Age_stage'],inplace=True)

In [4]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_stage
445,446,1,1,"Dodge, Master. Washington",male,4.0,0,2,33638,81.8583,A34,S,10
549,550,1,2,"Davies, Master. John Morgan Jr",male,8.0,1,1,C.A. 33112,36.7500,NaN,S,10
827,828,1,2,"Mallet, Master. Andre",male,1.0,0,2,S.C./PARIS 2079,37.0042,NaN,C,10
261,262,1,3,"Asplund, Master. Edvin Rojj Felix",male,3.0,4,2,347077,31.3875,NaN,S,10
172,173,1,3,"Johnson, Miss. Eleanor Ileen",female,1.0,1,1,347742,11.1333,NaN,S,10

In [5]:
# output to csv
titanic_df.to_csv('titanic_cleaned.csv')